Revit 2027 API
DimensionType.StyleType Property
 The dimension style type of this DimensionType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DimensionStyleType StyleType { get; }
Public ReadOnly Property StyleType As DimensionStyleType
	Get
public:
property DimensionStyleType StyleType {
	DimensionStyleType get ();
}
member StyleType : DimensionStyleType with get
Property Value
DimensionStyleType
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace